[
    {
        "id": "cissa-paragon",
        "title": "CISSA Paragon",
        "subtitle": "Faculty Student Association Website & Management System",
        "description": "A comprehensive full-stack platform for the Communication and Information Sciences Students' Association (CISSA) at the University of Ilorin, featuring a public-facing website and an admin dashboard for managing announcements, signatories, and content.",
        "longDescription": "Developed a modern, responsive web platform for CISSA that serves as both a public information hub and an administrative content management system. The platform showcases faculty departments, executives, news/announcements, and contact information while providing administrators with powerful tools to manage signatories and create rich-text announcements with image uploads. Built with Next.js 15 for optimal performance and SEO, FastAPI for a robust backend, and PostgreSQL for reliable data persistence.",
        "technologies": [
            "TypeScript",
            "Next.js 15",
            "React",
            "Tailwind CSS",
            "DaisyUI",
            "Python",
            "FastAPI",
            "PostgreSQL",
            "SQLAlchemy",
            "Alembic",
            "JWT Auth",
            "Supabase Storage",
            "Axios",
            "Lucide Icons"
        ],
        "features": [
            "Modern, responsive public website with hero section, statistics, and department showcase",
            "Dynamic news/announcements system with pagination and category filtering",
            "Admin dashboard with authentication and role-based access control",
            "Rich-text announcement editor with image upload to Supabase storage",
            "Signatory management system for announcement attribution",
            "Interactive image modals for announcement images",
            "WhatsApp contact integration for signatories",
            "Real-time dashboard statistics and recent activity overview",
            "Mobile-optimized navigation with collapsible sidebar",
            "SEO-optimized with proper metadata and Open Graph tags"
        ],
        "challenges": [
            "Implementing secure JWT-based authentication with token refresh mechanism",
            "Managing complex many-to-many relationships between announcements and signatories",
            "Optimizing image uploads and storage with Supabase integration",
            "Building a rich-text editor with formatting preservation",
            "Ensuring responsive design across mobile, tablet, and desktop devices",
            "Implementing proper pagination and state management for announcements",
            "Handling CORS and API authentication across frontend and backend"
        ],
        "achievements": [
            "Successfully deployed production-ready platform with full CRUD functionality",
            "Implemented comprehensive error handling and user feedback system",
            "Built reusable component library with DaisyUI and custom components",
            "Achieved proper separation of concerns with layout-based routing",
            "Implemented database migrations with Alembic for version control",
            "Created scalable API architecture with FastAPI and SQLAlchemy ORM",
            "Integrated third-party services (Supabase, Vercel Analytics)",
            "Maintained clean code architecture with proper TypeScript typing"
        ],
        "image": "/cissa.png",
        "demoUrl": "https://cissa-paragon-website-frontend.vercel.app/",
        "githubUrl": "https://github.com/cissaunilorin/cissa-paragon-website-frontend",
        "status": "Live",
        "featured": true
    },
    {
        "id": "kwiki-ai",
        "title": "Kwiki AI",
        "subtitle": "AI-Powered Flashcard Generator",
        "description": "A full-stack platform that generates intelligent flashcard decks from any topic using advanced LLMs, featuring interactive study modes and spaced repetition algorithms.",
        "longDescription": "Built a comprehensive learning platform that leverages DeepSeek-r1-distill-llama-70b to automatically generate educational flashcards from user-provided topics. The system includes user authentication, interactive study sessions, and intelligent spaced repetition to optimize learning retention.",
        "technologies": [
            "Python",
            "FastAPI",
            "PostgreSQL",
            "JWT Auth",
            "Groq API",
            "Google OAuth2",
            "React",
            "Tailwind CSS",
            "shadcn/ui"
        ],
        "features": [
            "AI-powered flashcard generation using advanced LLMs",
            "Interactive study mode with spaced repetition algorithm",
            "Secure authentication with JWT and Google OAuth2",
            "Responsive React frontend with modern UI/UX",
            "Scalable FastAPI backend with PostgreSQL database",
            "CI/CD deployment pipeline with GitHub Actions"
        ],
        "challenges": [
            "Optimizing LLM API calls for cost-effectiveness and speed",
            "Implementing spaced repetition algorithm for optimal learning",
            "Designing scalable database schema for flashcard relationships",
            "Managing user sessions and authentication across platforms"
        ],
        "achievements": [
            "Successfully deployed to production using Vercel and Render",
            "Achieved sub-2-second response times for flashcard generation",
            "Implemented comprehensive error handling and user feedback",
            "Built reusable component library for consistent UI"
        ],
        "image": "/kwiki_ai.png",
        "demoUrl": "https://kwiki-ai.vercel.app",
        "githubUrl": "https://github.com/bruce-pain/kwiki-ai-be",
        "status": "Live",
        "featured": true
    },
    {
        "id": "fundraiser-api",
        "title": "Fundraiser API",
        "subtitle": "Scalable Fundraising Platform",
        "description": "A comprehensive fundraising platform with secure payment processing, campaign management, and media handling capabilities.",
        "longDescription": "Developed a robust backend system for managing fundraising campaigns with integrated payment processing, user authentication, and file management. The platform supports multiple campaign types, donor management, and real-time progress tracking.",
        "technologies": [
            "Python",
            "FastAPI",
            "SQLAlchemy",
            "PostgreSQL",
            "Paystack API",
            "Cloudinary",
            "Pytest",
            "Alembic"
        ],
        "features": [
            "JWT-based authentication and authorization system",
            "Campaign creation and management with progress tracking",
            "Secure payment processing integration with Paystack",
            "Media upload and management via Cloudinary",
            "Comprehensive API documentation with FastAPI",
            "Database migrations with Alembic"
        ],
        "challenges": [
            "Implementing secure payment processing workflows",
            "Designing flexible database schema for various campaign types",
            "Handling file uploads and media optimization",
            "Ensuring data consistency across complex relationships"
        ],
        "achievements": [
            "Maintained 95%+ test coverage with comprehensive Pytest suite",
            "Built CI/CD pipeline with automated testing and deployment",
            "Implemented robust error handling and logging system",
            "Achieved scalable architecture supporting concurrent users"
        ],
        "image": "/fundraiser.png",
        "demoUrl": "https://fundraiser-project-api-production.up.railway.app/docs",
        "githubUrl": "",
        "status": "Live",
        "featured": false
    },
    {
        "id": "picture-txt",
        "title": "Picture.txt",
        "subtitle": "Image to ASCII Art Converter",
        "description": "A high-performance image processing service that converts images to ASCII art using OpenCV and custom algorithms.",
        "longDescription": "Created an efficient image processing service that transforms uploaded images into ASCII art representations. The system handles various image formats, provides customizable ASCII output options, and supports batch processing for high-volume conversions.",
        "technologies": ["Python", "FastAPI", "OpenCV", "Pillow"],
        "features": [
            "Support for multiple image formats (JPEG, PNG, GIF, etc.)",
            "Customizable ASCII output with various character sets",
            "Asynchronous processing for improved performance",
            "RESTful API endpoints for upload, and processing",
            "Optimized algorithms for faster conversion times"
        ],
        "challenges": [
            "Optimizing image processing algorithms for performance",
            "Handling memory management for large image files",
            "Implementing efficient character mapping algorithms",
            "Designing scalable async processing architecture"
        ],
        "achievements": [
            "Reduced processing time by 40% through algorithm optimization",
            "Implemented responsive async processing for scalable throughput",
            "Built robust error handling for various image formats",
            "Created intuitive API interface with comprehensive documentation"
        ],
        "image": "/picture_txt.png",
        "demoUrl": "https://picture-txt.vercel.app/",
        "githubUrl": "https://github.com/bruce-pain/picture-txt",
        "status": "Live",
        "featured": true
    }
]
